<a href="https://colab.research.google.com/github/kavinaya73766/python-project/blob/main/Titanic_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
file_path="/content/drive/MyDrive/Colab Notebooks/Titanic-Dataset.csv"

In [3]:
import numpy as np
import pandas as pd

In [4]:
data=pd.read_csv(file_path)

In [5]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
titanic_df = pd.DataFrame(data)

age_series = titanic_df['Age']
fare_series = titanic_df['Fare']
survived_series = titanic_df['Survived']

print(age_series.head())
print(fare_series.head())
print(survived_series.head())

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64
0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [8]:
print(titanic_df.head())
print(titanic_df.info())
print(titanic_df.describe())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [9]:
print(titanic_df.isnull().sum())

titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)

titanic_df['Embarked'].fillna(titanic_df['Embarked'].mode()[0], inplace=True)

titanic_df.dropna(inplace=True)

print("Missing values handled")

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
Missing values handled

/tmp/ipython-input-211/2329465123.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_df['Embarked'].fillna(titanic_df['Embarked'].mode()[0], inplace=True)

In [12]:
titanic_df.reset_index(drop=True, inplace=True)
print(titanic_df.loc[0])

print(titanic_df.iloc[0])

print(titanic_df[['Age', 'Fare', 'Survived']].head())

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 0, dtype: object
PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 0, dtype: object
    Age     Fare  Survived
0  38.0  71.2833         1
1  35.0  53.1000         1
2  54.0  51.8625         0
3   4.0  16.7000         1
4  58.0  26.5500         1

In [13]:
titanic_df.rename(columns={'Sex': 'Gender'}, inplace=True)

print(titanic_df.head())

pivot_table = titanic_df.pivot_table(values='Fare', index='Gender', columns='Pclass')
print(pivot_table)
melted_df = pd.melt(titanic_df, id_vars=['PassengerId'], value_vars=['Age','Fare'])
print(melted_df.head())

   PassengerId  Survived  Pclass  \
0            2         1       1
1            4         1       1
2            7         0       1
3           11         1       3
4           12         1       1

                                                Name  Gender   Age  SibSp  \
0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
2                            McCarthy, Mr. Timothy J    male  54.0      0
3                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
4                           Bonnell, Miss. Elizabeth  female  58.0      0

   Parch    Ticket     Fare Cabin Embarked
0      0  PC 17599  71.2833   C85        C
1      0    113803  53.1000  C123        S
2      0     17463  51.8625   E46        S
3      1   PP 9549  16.7000    G6        S
4      0    113783  26.5500  C103        S
Pclass           1         2          3
Gender
female  101.061420  14.61417  14.859717
male     72.815703  23.81250   8.537500
   PassengerId variable  value
0            2      Age   38.0
1            4      Age   35.0
2            7      Age   54.0
3           11      Age    4.0
4           12      Age   58.0

In [14]:
age_above_30 = titanic_df[titanic_df['Age'] > 30]
fare_above_50 = titanic_df[titanic_df['Fare'] > 50]
female_survived = titanic_df[(titanic_df['Gender'] == 'female') & (titanic_df['Survived'] == 1)]

print(female_survived.head())

print(titanic_df.sort_values(by='Fare').head())
print(titanic_df.sort_values(by='Age').head())
print(titanic_df.sort_values(by='Survived').head())

   PassengerId  Survived  Pclass  \
0            2         1       1
1            4         1       1
3           11         1       3
4           12         1       1
8           32         1       1

                                                Name  Gender        Age  \
0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.000000
1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.000000
3                    Sandstrom, Miss. Marguerite Rut  female   4.000000
4                           Bonnell, Miss. Elizabeth  female  58.000000
8     Spencer, Mrs. William Augustus (Marie Eugenie)  female  29.699118

   SibSp  Parch    Ticket      Fare Cabin Embarked
0      1      0  PC 17599   71.2833   C85        C
1      1      0    113803   53.1000  C123        S
3      1      1   PP 9549   16.7000    G6        S
4      0      0    113783   26.5500  C103        S
8      1      0  PC 17569  146.5208   B78        C
     PassengerId  Survived  Pclass                                      Name  \
52           264         0       1                     Harrison, Mr. William
188          816         0       1                          Fry, Mr. Richard
186          807         0       1                    Andrews, Mr. Thomas Jr
200          873         0       1                  Carlsson, Mr. Frans Olof
156          700         0       3  Humblen, Mr. Adolf Mathias Nicolai Olsen

    Gender        Age  SibSp  Parch  Ticket  Fare        Cabin Embarked
52    male  40.000000      0      0  112059  0.00          B94        S
188   male  29.699118      0      0  112058  0.00         B102        S
186   male  39.000000      0      0  112050  0.00          A36        S
200   male  33.000000      0      0     695  5.00  B51 B53 B55        S
156   male  42.000000      0      0  348121  7.65        F G63        S
    PassengerId  Survived  Pclass                            Name  Gender  \
64          306         1       1  Allison, Master. Hudson Trevor    male
35          184         1       2       Becker, Master. Richard F    male
60          298         0       1    Allison, Miss. Helen Loraine  female
40          206         0       3      Strom, Miss. Telma Matilda  female
79          341         1       2  Navratil, Master. Edmond Roger    male

     Age  SibSp  Parch  Ticket      Fare    Cabin Embarked
64  0.92      1      2  113781  151.5500  C22 C26        S
35  1.00      2      1  230136   39.0000       F4        S
60  2.00      1      2  113781  151.5500  C22 C26        S
40  2.00      0      1  347054   10.4625       G6        S
79  2.00      1      1  230080   26.0000       F2        S
    PassengerId  Survived  Pclass                            Name Gender  \
2             7         0       1         McCarthy, Mr. Timothy J   male
7            28         0       1  Fortune, Mr. Charles Alexander   male
13           63         0       1     Harris, Mr. Henry Birkhardt   male
10           55         0       1  Ostby, Mr. Engelhart Cornelius   male
15           76         0       3         Moen, Mr. Sigurd Hansen   male

     Age  SibSp  Parch  Ticket      Fare        Cabin Embarked
2   54.0      0      0   17463   51.8625          E46        S
7   19.0      3      2   19950  263.0000  C23 C25 C27        S
13  45.0      1      0   36973   83.4750          C83        S
10  65.0      0      1  113509   61.9792          B30        C
15  25.0      0      0  348123    7.6500        F G73        S

In [15]:
survival_by_gender = titanic_df.groupby('Gender')['Survived'].mean()
print(survival_by_gender)

avg_age_class = titanic_df.groupby('Pclass')['Age'].mean()
print(avg_age_class)

survival_by_embarked = titanic_df.groupby('Embarked')['Survived'].sum()
print(survival_by_embarked)

Gender
female    0.938144
male      0.420561
Name: Survived, dtype: float64
Pclass
1    37.014806
2    25.543695
3    22.449853
Name: Age, dtype: float64
Embarked
C    52
Q     2
S    82
Name: Survived, dtype: int64

In [16]:
class_info = pd.DataFrame({
    'Pclass': [1,2,3],
    'Class_Type': ['First Class','Second Class','Third Class']
})

merged_df = pd.merge(titanic_df, class_info, on='Pclass')
print(merged_df.head())

joined_df = titanic_df.join(class_info.set_index('Pclass'), on='Pclass')
print(joined_df.head())

df_part1 = titanic_df.iloc[:100]
df_part2 = titanic_df.iloc[100:200]

concat_df = pd.concat([df_part1, df_part2])
print(concat_df.head())

   PassengerId  Survived  Pclass  \
0            2         1       1
1            4         1       1
2            7         0       1
3           11         1       3
4           12         1       1

                                                Name  Gender   Age  SibSp  \
0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
2                            McCarthy, Mr. Timothy J    male  54.0      0
3                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
4                           Bonnell, Miss. Elizabeth  female  58.0      0

   Parch    Ticket     Fare Cabin Embarked   Class_Type
0      0  PC 17599  71.2833   C85        C  First Class
1      0    113803  53.1000  C123        S  First Class
2      0     17463  51.8625   E46        S  First Class
3      1   PP 9549  16.7000    G6        S  Third Class
4      0    113783  26.5500  C103        S  First Class
   PassengerId  Survived  Pclass  \
0            2         1       1
1            4         1       1
2            7         0       1
3           11         1       3
4           12         1       1

                                                Name  Gender   Age  SibSp  \
0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
2                            McCarthy, Mr. Timothy J    male  54.0      0
3                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
4                           Bonnell, Miss. Elizabeth  female  58.0      0

   Parch    Ticket     Fare Cabin Embarked   Class_Type
0      0  PC 17599  71.2833   C85        C  First Class
1      0    113803  53.1000  C123        S  First Class
2      0     17463  51.8625   E46        S  First Class
3      1   PP 9549  16.7000    G6        S  Third Class
4      0    113783  26.5500  C103        S  First Class
   PassengerId  Survived  Pclass  \
0            2         1       1
1            4         1       1
2            7         0       1
3           11         1       3
4           12         1       1

                                                Name  Gender   Age  SibSp  \
0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
2                            McCarthy, Mr. Timothy J    male  54.0      0
3                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
4                           Bonnell, Miss. Elizabeth  female  58.0      0

   Parch    Ticket     Fare Cabin Embarked
0      0  PC 17599  71.2833   C85        C
1      0    113803  53.1000  C123        S
2      0     17463  51.8625   E46        S
3      1   PP 9549  16.7000    G6        S
4      0    113783  26.5500  C103        S

In [17]:
avg_age_survival = titanic_df.groupby('Survived')['Age'].mean()
print(avg_age_survival)

highest_fare = titanic_df['Fare'].max()
lowest_fare = titanic_df['Fare'].min()
print("Highest Fare:", highest_fare)
print("Lowest Fare:", lowest_fare)

survival_percentage = titanic_df['Survived'].mean() * 100
print("Survival Percentage:", survival_percentage)

Survived
0    39.979308
1    32.897870
Name: Age, dtype: float64
Highest Fare: 512.3292
Lowest Fare: 0.0
Survival Percentage: 66.66666666666666